import { debugAnimation } from "../../serve/animation.mjs";
import { g, rect } from "../../base.mjs";
import { zirnevis } from "../zirnevis.mjs";

const background = rect({
  x: 0, y: 0, height: 300, width: 400, fill: '#000',
});

const all = g([
  background,
  zirnevis([
    'سلام',
    1,
    'توی چند سال اخیر دانش آموزای غیر تهرانی نتونستن توی المپیاد کامپیوتر نتایج جالبی بگیرن',
    5,
    'می دونید چرا؟',
    7,
    'المپیاد کامپیوتر یه طوریه که منابعش خیلی از منابع کتاب درسی دوره',
    10,
    'یعنی عملا هیچ ارتباطی به دروس دبیرستان نداره',
    13,
    'بعضی از مدارس، مخصوصا توی تهران برای المپیاد کلاس های ویژه ای دارن',
    18,
    'کلاس هایی که به طور منظم مطالب المپیاد رو آموزش می ده',
    22,
    'تمرین می ده و آزمون می گیره',
    24,
    'و دانش آموزایی که توی این مدارس نیستن',
    27,
    'حتی اگه خودشون منابع رو مطالعه کنن',
    30,
    'به سختی می تونن با اون تشکیلات عظیم رقابت کنن',
    34,
    'مثلا دبیرستان علامه حلی تهران، هر سال حدود ۳۰ نفر رو مورد آموزش قرار می ده',
    39,
    'که ۲۵ نفرشون مرحله دوم المپیاد کامپیوتر رو قبول می شن',
    42,
    'بیشتر از ده ها استان در تمامی دوره های برگزاری المپیاد کامپیوتر!',
    46,
    'راه حل چیه؟',
    47,
    'این درست نیست که المپیاد که یه امکان ملیه، در اختیار یه سری مدارس محدود باشه',
    52,
    'راه حل ماواکه!',
    54,
    'مدرسه آموزش و استعداد یابی المپیاد کامپیوتر',
    57,
    'مدرسه ای که می خواد شرایط مدرسه های بزرگ رو برای شما فراهم کنه',
    61,
    'تشکیل شده از همون معلم های مدارس بزرگ تهران',
    66,
    'کاملا رایگان!',
    68,
    'برای شما و برای عدالت',
    70,
    'فقط کافیه که توی آزمون ماواک ثبت نام کنین',
    73,
    'ماواک دات شاز دات کام',
  ]),
]);

const main = () => {
  debugAnimation(all, { viewBox: '0 0 400 300' });
};

main();
